In [ ]:
Pandas questions to practice:

1. DataFrame Manipulation:
Given a DataFrame df with columns [‘Name’, ‘Age’, ‘Gender’, ‘Department’, ‘Salary’], perform the following tasks:
1)Filter the DataFrame to include only rows where the Salary is greater than 50,000.
2)Group the DataFrame by Department and calculate the mean Salary for each department.
3)Add a new column Salary_Hike that increases each employee’s salary by 10%.
4)Replace missing values in the Age column with the median age.

2. Data Aggregation:
You have a DataFrame sales_df with columns [‘Date’, ‘Product’, ‘Region’, ‘Sales’]. Perform the following:
1)Create a pivot table that shows the total sales for each Product by Region.
2)Calculate the cumulative sales by Product over time.
3)Find the top 3 Product with the highest total sales.

3. Handling Missing Data:
Consider a DataFrame df with columns [‘ID’, ‘Age’, ‘Gender’, ‘Income’, ‘Spending_Score’]. Some of the data points in Age and Income are missing. Perform the following:
1)Count the number of missing values in each column.
2)Impute the missing Age values with the median age, and Income with the mean income.
3)Drop rows where more than two columns have missing values.

4. Data Transformation:
Given a DataFrame orders_df with columns [‘OrderID’, ‘CustomerID’, ‘Product’, ‘Quantity’, ‘Price’], perform the following:
1)Create a new column Total_Cost that is the product of Quantity and Price.
2)Sort the DataFrame by CustomerID and Total_Cost in descending order.
3)Extract all unique products bought by each customer.
4)Normalise the Price column using min-max scaling.

In [1]:
import pandas as pd

/Users/navyatrilok/opt/anaconda3/lib/python3.9/site-packages/pandas/core/computation/expressions.py:21: UserWarning: Pandas requires version '2.8.4' or newer of 'numexpr' (version '2.8.3' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED
/Users/navyatrilok/opt/anaconda3/lib/python3.9/site-packages/pandas/core/arrays/masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [27]:
data = {'Name':['Navya','Uma','Trilok','Vana','Pinky','Neethu'], 'Age':[21,22,50,40,10,14],'Gender':['F','F','M','F','F','M'],
        'Department':['Education','Education','Railway','Finance','IT','IT'],'Salary':[1000,5000,100000,3000,3000,6000]
       }

In [14]:
data

{'Name': ['Navya', 'Uma', 'Trilok', 'Vana', 'Pinky', 'Neethu'],
 'Age': [21, 22, 50, 40, 10, 14],
 'Gender': ['F', 'F', 'M', 'F', 'F', 'M'],
 'Department': ['Education', 'Education', 'Railway', 'Finance', 'IT', 'IT'],
 'Salary': [1000, 5000, 100000, 3000, 3000, 6000]}

In [15]:
df = pd.DataFrame(data)

In [16]:
df.head()

     Name  Age Gender Department  Salary
0   Navya   21      F  Education    1000
1     Uma   22      F  Education    5000
2  Trilok   50      M    Railway  100000
3    Vana   40      F    Finance    3000
4   Pinky   10      F         IT    3000

In [ ]:
1)Filter the DataFrame to include only rows where the Salary is greater than 3000

In [17]:
df[df['Salary'] > 3000]

     Name  Age Gender Department  Salary
1     Uma   22      F  Education    5000
2  Trilok   50      M    Railway  100000
5  Neethu   14      M         IT    6000

In [ ]:
2)Group the DataFrame by Department and calculate the mean Salary for each department.

In [19]:
df[['Department','Salary']].groupby('Department').mean()

              Salary
Department
Education     3000.0
Finance       3000.0
IT            4500.0
Railway     100000.0

In [ ]:
3)Add a new column Salary_Hike that increases each employee’s salary by 10%.

In [20]:
df['Salary_Hike'] = df.Salary.apply(lambda x: x + (x*0.1))

In [21]:
df

     Name  Age Gender Department  Salary  Salary_Hike
0   Navya   21      F  Education    1000       1100.0
1     Uma   22      F  Education    5000       5500.0
2  Trilok   50      M    Railway  100000     110000.0
3    Vana   40      F    Finance    3000       3300.0
4   Pinky   10      F         IT    3000       3300.0
5  Neethu   14      M         IT    6000       6600.0

## 4)Replace missing values in the Age column with the median age.

In [ ]:
median_age = df.Age.median()

In [ ]:
df['Age'] = df.Age.apply(lambda x: median_age if pd.isna(x) else x)

## 2. Data Aggregation:

In [ ]:
You have a DataFrame sales_df with columns [‘Date’, ‘Product’, ‘Region’, ‘Sales’]. Perform the following:

In [28]:
data = {'Date':['12/07/2024','11/08/2024','12/07/2024','10/09/2024','11/09/2023'],'Product':['A','B','C','D','E'],
       'Region':['APAC','EMEA','Americas','APAC','EMEA'],'Sales':[5000,10000,4000,1000,6000]}

In [29]:
df = pd.DataFrame(data)

In [ ]:
1)Create a pivot table that shows the total sales for each Product by Region.

In [32]:
pd.pivot_table(values='Sales',columns='Region',index='Product',aggfunc='sum',data=df)

Region     APAC  Americas     EMEA
Product
A        5000.0       NaN      NaN
B           NaN       NaN  10000.0
C           NaN    4000.0      NaN
D        1000.0       NaN      NaN
E           NaN       NaN   6000.0

In [33]:
pd.pivot_table(values='Sales',columns='Product',index='Region',aggfunc='sum',data=df)

Product        A        B       C       D       E
Region
APAC      5000.0      NaN     NaN  1000.0     NaN
Americas     NaN      NaN  4000.0     NaN     NaN
EMEA         NaN  10000.0     NaN     NaN  6000.0

In [ ]:
2)Calculate the cumulative sales by Product over time.

In [4]:
import pandas as pd

/Users/navyatrilok/opt/anaconda3/lib/python3.9/site-packages/pandas/core/computation/expressions.py:21: UserWarning: Pandas requires version '2.8.4' or newer of 'numexpr' (version '2.8.3' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED
/Users/navyatrilok/opt/anaconda3/lib/python3.9/site-packages/pandas/core/arrays/masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [5]:
data = {'Date':['12/07/2024','11/08/2024','12/07/2024','10/09/2024','11/09/2023','12/07/2024'],'Product':['A','B','C','D','E','A'],
       'Region':['APAC','EMEA','Americas','APAC','EMEA','APAC'],'Sales':[5000,10000,4000,1000,6000,7000]}

In [6]:
df = pd.DataFrame(data)

In [7]:
df.dtypes

Date       object
Product    object
Region     object
Sales       int64
dtype: object

In [18]:
df.sort_values(by=['Product','Date'])

         Date Product    Region  Sales  cumsum
0  12/07/2024       A      APAC   5000    5000
5  12/07/2024       A      APAC   7000   12000
1  11/08/2024       B      EMEA  10000   10000
2  12/07/2024       C  Americas   4000    4000
3  10/09/2024       D      APAC   1000    1000
4  11/09/2023       E      EMEA   6000    6000

In [19]:
df['cumsum'] = df[['Product','Sales']].groupby('Product').cumsum()

In [20]:
df

         Date Product    Region  Sales  cumsum
0  12/07/2024       A      APAC   5000    5000
1  11/08/2024       B      EMEA  10000   10000
2  12/07/2024       C  Americas   4000    4000
3  10/09/2024       D      APAC   1000    1000
4  11/09/2023       E      EMEA   6000    6000
5  12/07/2024       A      APAC   7000   12000

In [40]:
#df['year'] = pd.to_datetime(df['Date'],format='%m/%d/%y').dt.year

df['year'] = pd.to_datetime(df['Date'],format='%m/%d/%y').dt.year

df['year','sales'].groupby('year').sum()

ValueError: unconverted data remains when parsing with format "%m/%d/%y": "24", at position 0. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [ ]:
3)Find the top 3 Product with the highest total sales.

In [43]:
df[['Product','Sales']].groupby('Product').sum().sort_values(by='Sales',ascending=False).head(3)

         Sales
Product
B        10000
E         6000
A         5000

## 3. Handling Missing Data:

In [ ]:
Consider a DataFrame df with columns [‘ID’, ‘Age’, ‘Gender’, ‘Income’, ‘Spending_Score’]. 
Some of the data points in Age and Income are missing. Perform the following:

In [75]:
df = pd.read_csv('/Users/navyatrilok/Documents/DATASCIENCE/pandaspracticedata.csv')

In [76]:
df

   ID   Age Gender   Income  Spending_Score
0   1  25.0      F   1000.0               1
1   2  24.0      M   5000.0               5
2   3   NaN      F  10000.0               1
3   4  24.0      F   1000.0               2
4   5  25.0      M      NaN               4
5   6   NaN      M   4000.0               1
6   7  29.0      F      NaN               2
7   8  12.0      M   3000.0               1
8   9  13.0      F   2000.0               5
9  10   NaN      F      NaN               1

In [ ]:
1)Count the number of missing values in each column.

In [58]:
df[['ID','Age','Gender','Income','Spending_Score']].isna().sum()

ID                0
Age               3
Gender            0
Income            3
Spending_Score    0
dtype: int64

In [ ]:
2)Impute the missing Age values with the median age, and Income with the mean income.

In [69]:
median_age = df.Age.median()

In [70]:
median_age

24.0

In [77]:
#df.Age.apply(lambda x: df.Age.median if df['Age'].isna()==True else 0)

median_age = df.Age.median()

df['Age'] = df.Age.apply(lambda x: median_age if pd.isna(x) else x)

In [78]:
df

   ID   Age Gender   Income  Spending_Score
0   1  25.0      F   1000.0               1
1   2  24.0      M   5000.0               5
2   3  24.0      F  10000.0               1
3   4  24.0      F   1000.0               2
4   5  25.0      M      NaN               4
5   6  24.0      M   4000.0               1
6   7  29.0      F      NaN               2
7   8  12.0      M   3000.0               1
8   9  13.0      F   2000.0               5
9  10  24.0      F      NaN               1

In [79]:
mean_income = df.Income.mean()

In [80]:
df['Income'] = df.Income.apply(lambda x: mean_income if pd.isna(x) else x)

In [81]:
df

   ID   Age Gender        Income  Spending_Score
0   1  25.0      F   1000.000000               1
1   2  24.0      M   5000.000000               5
2   3  24.0      F  10000.000000               1
3   4  24.0      F   1000.000000               2
4   5  25.0      M   3714.285714               4
5   6  24.0      M   4000.000000               1
6   7  29.0      F   3714.285714               2
7   8  12.0      M   3000.000000               1
8   9  13.0      F   2000.000000               5
9  10  24.0      F   3714.285714               1

In [ ]:
3)Drop rows where more than two columns have missing values.

In [94]:
df = pd.read_csv('/Users/navyatrilok/Documents/DATASCIENCE/pandaspracticedata.csv')

In [95]:
print(df.isnull().sum(axis=1))

0    0
1    0
2    1
3    0
4    1
5    1
6    1
7    0
8    0
9    2
dtype: int64

In [99]:
df_cleaned = df.dropna(thresh=len(df.columns) - 2)

In [100]:
df_cleaned

   ID   Age Gender   Income  Spending_Score
0   1  25.0      F   1000.0               1
1   2  24.0      M   5000.0               5
2   3   NaN      F  10000.0               1
3   4  24.0      F   1000.0               2
4   5  25.0      M      NaN               4
5   6   NaN      M   4000.0               1
6   7  29.0      F      NaN               2
7   8  12.0      M   3000.0               1
8   9  13.0      F   2000.0               5
9  10   NaN      F      NaN               1

In [89]:
data = {
    'Age': [25, None, None, 22, 30],
    'Salary': [50000, None, 55000, None, None],
    'Department': ['HR', 'IT', None, None, 'Finance'],
    'Location': ['NY', None, 'LA', None, 'SF']
}

In [90]:
df = pd.DataFrame(data)

In [91]:
df

    Age   Salary Department Location
0  25.0  50000.0         HR       NY
1   NaN      NaN         IT     None
2   NaN  55000.0       None       LA
3  22.0      NaN       None     None
4  30.0      NaN    Finance       SF

In [92]:
cleaned_df = df.dropna(thresh=len(df.columns)-2)

In [93]:
cleaned_df

    Age   Salary Department Location
0  25.0  50000.0         HR       NY
2   NaN  55000.0       None       LA
4  30.0      NaN    Finance       SF

## 4. Data Transformation:

In [ ]:
Given a DataFrame orders_df with columns [‘OrderID’, ‘CustomerID’, ‘Product’, ‘Quantity’, ‘Price’], 
perform the following:

In [106]:
data = {'OrderId':[1,2,3,4,5],'CustomerID':['a','b','c','d','e'],'Product':[123,456,789,101,102],'Quantity':[1,2,1,4,2],'Price':[1000,2000,3000,4000,5000]}

In [107]:
df = pd.DataFrame(data)

In [108]:
df

   OrderId CustomerID  Product  Quantity  Price
0        1          a      123         1   1000
1        2          b      456         2   2000
2        3          c      789         1   3000
3        4          d      101         4   4000
4        5          e      102         2   5000

In [109]:
1)Create a new column Total_Cost that is the product of Quantity and Price.

SyntaxError: unmatched ')' (2145225764.py, line 1)

In [114]:
df['Total_Cost'] = df.apply(lambda row: row['Quantity']*row['Price'], axis=1)

In [115]:
df

   OrderId CustomerID  Product  Quantity  Price  Total_Quantity  Total_Cost
0        1          a      123         1   1000            1000        1000
1        2          b      456         2   2000            4000        4000
2        3          c      789         1   3000            3000        3000
3        4          d      101         4   4000           16000       16000
4        5          e      102         2   5000           10000       10000

In [ ]:
2)Sort the DataFrame by CustomerID and Total_Cost in descending order.

In [116]:
df.sort_values(by=['CustomerID','Total_Cost'],ascending=False)

   OrderId CustomerID  Product  Quantity  Price  Total_Quantity  Total_Cost
4        5          e      102         2   5000           10000       10000
3        4          d      101         4   4000           16000       16000
2        3          c      789         1   3000            3000        3000
1        2          b      456         2   2000            4000        4000
0        1          a      123         1   1000            1000        1000

In [ ]:
3)Extract all unique products bought by each customer.

In [118]:
df

   OrderId CustomerID  Product  Quantity  Price  Total_Quantity  Total_Cost
0        1          a      123         1   1000            1000        1000
1        2          b      456         2   2000            4000        4000
2        3          c      789         1   3000            3000        3000
3        4          d      101         4   4000           16000       16000
4        5          e      102         2   5000           10000       10000

In [119]:
df.Product.unique()

array([123, 456, 789, 101, 102])

In [123]:
unique_products = df.groupby('CustomerID')['Product'].unique().reset_index()

In [127]:
df.groupby('CustomerID')['Product'].unique()

CustomerID
a    [123]
b    [456]
c    [789]
d    [101]
e    [102]
Name: Product, dtype: object

In [124]:
unique_products

  CustomerID Product
0          a   [123]
1          b   [456]
2          c   [789]
3          d   [101]
4          e   [102]

In [128]:
data = {
    'CustomerID': [1, 1, 2, 2, 3, 1, 3],
    'Product': ['Apple', 'Banana', 'Apple', 'Orange', 'Banana', 'Apple', 'Apple']
}

df = pd.DataFrame(data)

# Extract unique products bought by each customer
unique_products = df.groupby('CustomerID')['Product'].unique().reset_index()

In [129]:
unique_products

   CustomerID          Product
0           1  [Apple, Banana]
1           2  [Apple, Orange]
2           3  [Banana, Apple]

In [ ]:
4)Normalise the Price column using min-max scaling.

In [131]:
data = {'OrderId':[1,2,3,4,5],'CustomerID':['a','b','c','d','e'],'Product':[123,456,789,101,102],'Quantity':[1,2,1,4,2],'Price':[1000,2000,3000,4000,5000]}

In [133]:
df = pd.DataFrame(data)

In [134]:
min_price = df['Price'].min()
max_price = df['Price'].max()

df['Normalized_Price'] = (df['Price'] - min_price) / (max_price - min_price)

In [135]:
df

   OrderId CustomerID  Product  Quantity  Price  Normalized_Price
0        1          a      123         1   1000              0.00
1        2          b      456         2   2000              0.25
2        3          c      789         1   3000              0.50
3        4          d      101         4   4000              0.75
4        5          e      102         2   5000              1.00